Environment: dev. Pipeline Stage: dev
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwcca01" -> "rule-433-lbxwcca01" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_probe" "health_probe" {
      ~ id                  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
      ~ load_balancer_rules = [
          - "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01",
        ] -> (known after apply)
      ~ name                = "rule-3389-lbxwctestca01" -> "rule-433-lbxwctestca01" # forces replacement
      ~ port                = 3389 -> 433
      ~ protocol            = "Tcp" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/backendAddressPools/be-lbxwcca01" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/frontendIPConfigurations/fe-lbxwcca01" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/loadBalancingRules/rule-3389-lbxwcca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwcca01" -> "rule-433-lbxwcca01" # forces replacement
      ~ probe_id                       = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwcca01/probes/rule-3389-lbxwcca01" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwctestca01"] must be replaced
-/+ resource "azurerm_lb_rule" "loadbalancing_rule" {
      ~ backend_address_pool_id        = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/backendAddressPools/be-lbxwctestca01" -> (known after apply)
      ~ backend_port                   = 3389 -> 433
      - enable_tcp_reset               = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/frontendIPConfigurations/fe-lbxwctestca01" -> (known after apply)
      ~ frontend_port                  = 3389 -> 433
      ~ id                             = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/loadBalancingRules/rule-3389-lbxwctestca01" -> (known after apply)
      ~ idle_timeout_in_minutes        = 4 -> (known after apply)
      ~ load_distribution              = "SourceIPProtocol" -> "SourceIP"
      ~ name                           = "rule-3389-lbxwctestca01" -> "rule-433-lbxwctestca01" # forces replacement
      ~ probe_id                       = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Network/loadBalancers/lbxwctestca01/probes/rule-3389-lbxwctestca01" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.